In [2]:
from pymongo import MongoClient

In [3]:
client = MongoClient(
    host = 'localhost',
    port = 27017
)

In [4]:
client.list_database_names()

['admin', 'config', 'local', 'ubion']

In [5]:
db = client["ubion"]
list(db.test.find())
### list(db["test"].find())  <<  이것도 가능하다

[{'_id': ObjectId('62328e8cc61a966784469ae3'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('62328f17c61a966784469ae4'),
  'name': 'test2',
  'phone': '01011111111'},
 {'_id': ObjectId('6232905bc61a966784469ae5'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905bc61a966784469ae6'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'}]

In [6]:
data = {
    "1" : "1",
    "2" : "2",
    "3" : "3"

}
db.test.insert_one(data)

In [ ]:
### data 변수 만들어서 insert_many를 사용해볼것

In [7]:
data = [{
    "1" : "2"
},
{"3" : "4"}
]

db.test.insert_many(data)

In [8]:
list(db.test.find())

[{'_id': ObjectId('62328e8cc61a966784469ae3'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('62328f17c61a966784469ae4'),
  'name': 'test2',
  'phone': '01011111111'},
 {'_id': ObjectId('6232905bc61a966784469ae5'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905bc61a966784469ae6'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('6232980c237b0e4520a3e9e3'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329a5a237b0e4520a3e9e4'), '1': '2'},
 {'_id': ObjectId('62329a5a237b0e4520a3e9e5'), '3': '4'}]

In [9]:
import mod_sql
_db = mod_sql.Database()

In [13]:
sql = """
        SELECT * FROM emp
"""

result = _db._executeAll(sql)
result

[{'EMPNO': Decimal('7369'),
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': Decimal('7902'),
  'HIREDATE': datetime.date(1980, 12, 17),
  'SAL': Decimal('800.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7499'),
  'ENAME': 'ALLEN',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 2, 20),
  'SAL': Decimal('1600.00'),
  'COMM': Decimal('300.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7521'),
  'ENAME': 'WARD',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 2, 22),
  'SAL': Decimal('1250.00'),
  'COMM': Decimal('500.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7566'),
  'ENAME': 'JONES',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 4, 2),
  'SAL': Decimal('2975.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7654'),
  'ENAME': 'MARTIN',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 9, 28),
  'SAL': Decimal('1250.00'),
  'COMM': Decimal('1400.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7698'),
  'ENAME': 'BLAKE',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 5, 1),
  'SAL': Decimal('2850.00'),
  'COMM': None,
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7782'),
  'ENAME': 'CLARK',
  'JOB': 'MANAGER',
  'MGR': Decimal('7839'),
  'HIREDATE': datetime.date(1981, 6, 9),
  'SAL': Decimal('2450.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')},
 {'EMPNO': Decimal('7788'),
  'ENAME': 'SCOTT',
  'JOB': 'ANALYST',
  'MGR': Decimal('7566'),
  'HIREDATE': datetime.date(1987, 6, 28),
  'SAL': Decimal('3000.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7839'),
  'ENAME': 'KING',
  'JOB': 'PRESIDENT',
  'MGR': None,
  'HIREDATE': datetime.date(1981, 11, 17),
  'SAL': Decimal('5000.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')},
 {'EMPNO': Decimal('7844'),
  'ENAME': 'TURNER',
  'JOB': 'SALESMAN',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 9, 8),
  'SAL': Decimal('1500.00'),
  'COMM': Decimal('0.00'),
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7876'),
  'ENAME': 'ADAMS',
  'JOB': 'CLERK',
  'MGR': Decimal('7788'),
  'HIREDATE': datetime.date(1987, 7, 13),
  'SAL': Decimal('1100.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7900'),
  'ENAME': 'JAMES',
  'JOB': 'CLERK',
  'MGR': Decimal('7698'),
  'HIREDATE': datetime.date(1981, 12, 3),
  'SAL': Decimal('950.00'),
  'COMM': None,
  'DEPTNO': Decimal('30')},
 {'EMPNO': Decimal('7902'),
  'ENAME': 'FORD',
  'JOB': 'ANALYST',
  'MGR': Decimal('7566'),
  'HIREDATE': datetime.date(1981, 12, 3),
  'SAL': Decimal('3000.00'),
  'COMM': None,
  'DEPTNO': Decimal('20')},
 {'EMPNO': Decimal('7934'),
  'ENAME': 'MILLER',
  'JOB': 'CLERK',
  'MGR': Decimal('7782'),
  'HIREDATE': datetime.date(1982, 1, 23),
  'SAL': Decimal('1300.00'),
  'COMM': None,
  'DEPTNO': Decimal('10')}]

In [14]:
db.emp.find_one()

{'_id': ObjectId('6232b721c3d2aaebd5167815'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [15]:
list(db.emp.find(
    {
        "ENAME" : "SMITH"
    }

)
)
### SELECT * FROM emp WHERE ENAME = "SMITH" 랑 같은 내용이다.

[{'_id': ObjectId('6232b721c3d2aaebd5167815'),
  'EMPNO': '7369',
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': '7902',
  'HIREDATE': '1980-12-17',
  'SAL': '800.00',
  'DEPTNO': '20'}]

In [16]:
result = db.emp.find()

for list in result:
    print(list)

{'_id': ObjectId('6232b721c3d2aaebd5167815'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167816'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167817'), 'EMPNO': '7521', 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-22', 'SAL': '1250.00', 'COMM': '500.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167818'), 'EMPNO': '7566', 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-04-02', 'SAL': '2975.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167819'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-28', 'SAL': '1250.00', 'COMM': '1400.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781a'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-05-01', 'SAL': '2850.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781b'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-06-09', 'SAL': '2450.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b721c3d2aaebd516781c'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1987-06-28', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd516781d'), 'EMPNO': '7839', 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': '5000.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b721c3d2aaebd516781e'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-08', 'SAL': '1500.00', 'COMM': '0.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781f'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167820'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167821'), 'EMPNO': '7902', 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1981-12-03', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167822'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}

In [ ]:
### emp collection
### key 값이 EMPNO, ENAME, DEPTNO만 출력이 되도록 코드를 작성

In [21]:
result = db.emp.find(
    {},                     ### WHERE 절
    {"EMPO" : 1, "ENAME" : 1, "DEPTNO" : 1}                      ### COLUMN 절
)
for list in result:
    print(list)

### SELECT EMPNO, ENAME, DEPTNO FROM emp

{'_id': ObjectId('6232b721c3d2aaebd5167815'), 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167816'), 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167817'), 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167818'), 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167819'), 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781a'), 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781b'), 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b721c3d2aaebd516781c'), 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd516781d'), 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b721c3d2aaebd516781e'), 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd516781f'), 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167820'), 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b721c3d2aaebd5167821'), 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167822'), 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [24]:
# 급여가 2000보다 큰 데이터 값을 출력
result = db.emp.find(
    {
        "SAL" : {"$gt" : 2000}
    }
)

for list in result:
    print(list)

### SELECT * FROM emp WHERE SAL > 2000

{'_id': ObjectId('6232c6a7c3d2aaebd5167826'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6a7c3d2aaebd5167828'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6a7c3d2aaebd5167829'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6a7c3d2aaebd516782a'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6a7c3d2aaebd516782b'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6a7c3d2aaebd516782f'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [25]:
import pprint
result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

### SELECT * FROM emp ORDER BY "ENAME"

{'DEPTNO': '20',
 'EMPNO': '7876',
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': '7788',
 'SAL': '1100.00',
 '_id': ObjectId('6232b721c3d2aaebd516781f')}
{'DEPTNO': 20,
 'EMPNO': 7876,
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': 7788,
 'SAL': 1100.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782d')}
{'COMM': '300.00',
 'DEPTNO': '30',
 'EMPNO': '7499',
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1600.00',
 '_id': ObjectId('6232b721c3d2aaebd5167816')}
{'COMM': 300.0,
 'DEPTNO': 30,
 'EMPNO': 7499,
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1600.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167824')}
{'DEPTNO': '30',
 'EMPNO': '7698',
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2850.00',
 '_id': ObjectId('6232b721c3d2aaebd516781a')}
{'DEPTNO': 30,
 'EMPNO': 7698,
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2850.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167828')}
{'DEPTNO': '10',
 'EMPNO': '7782',
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2450.00',
 '_id': ObjectId('6232b721c3d2aaebd516781b')}
{'DEPTNO': 10,
 'EMPNO': 7782,
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2450.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167829')}
{'DEPTNO': '20',
 'EMPNO': '7902',
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b721c3d2aaebd5167821')}
{'DEPTNO': 20,
 'EMPNO': 7902,
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782f')}
{'DEPTNO': '30',
 'EMPNO': '7900',
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': '7698',
 'SAL': '950.00',
 '_id': ObjectId('6232b721c3d2aaebd5167820')}
{'DEPTNO': 30,
 'EMPNO': 7900,
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': 7698,
 'SAL': 950.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782e')}
{'DEPTNO': '20',
 'EMPNO': '7566',
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2975.00',
 '_id': ObjectId('6232b721c3d2aaebd5167818')}
{'DEPTNO': 20,
 'EMPNO': 7566,
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2975.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167826')}
{'DEPTNO': '10',
 'EMPNO': '7839',
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': '5000.00',
 '_id': ObjectId('6232b721c3d2aaebd516781d')}
{'DEPTNO': 10,
 'EMPNO': 7839,
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': 5000.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782b')}
{'COMM': '1400.00',
 'DEPTNO': '30',
 'EMPNO': '7654',
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b721c3d2aaebd5167819')}
{'COMM': 1400.0,
 'DEPTNO': 30,
 'EMPNO': 7654,
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167827')}
{'DEPTNO': '10',
 'EMPNO': '7934',
 'ENAME': 'MILLER',
 'HIREDATE': '1982-01-23',
 'JOB': 'CLERK',
 'MGR': '7782',
 'SAL': '1300.00',
 '_id': ObjectId('6232b721c3d2aaebd5167822')}
{'DEPTNO': 10,
 'EMPNO': 7934,
 'ENAME': 'MILLER',
 'HIREDATE': '1982-01-23',
 'JOB': 'CLERK',
 'MGR': 7782,
 'SAL': 1300.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167830')}
{'DEPTNO': '20',
 'EMPNO': '7788',
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b721c3d2aaebd516781c')}
{'DEPTNO': 20,
 'EMPNO': 7788,
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782a')}
{'DEPTNO': '20',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': '7902',
 'SAL': '800.00',
 '_id': ObjectId('6232b721c3d2aaebd5167815')}
{'DEPTNO': 20,
 'EMPNO': 7369,
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': 7902,
 'SAL': 800.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167823')}
{'COMM': '0.00',
 'DEPTNO': '30',
 'EMPNO': '7844',
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1500.00',
 '_id': ObjectId('6232b721c3d2aaebd516781e')}
{'COMM': 0.0,
 'DEPTNO': 30,
 'EMPNO': 7844,
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1500.0,
 '_id': ObjectId('6232c6a7c3d2aaebd516782c')}
{'COMM': '500.00',
 'DEPTNO': '30',
 'EMPNO': '7521',
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b721c3d2aaebd5167817')}
{'COMM': 500.0,
 'DEPTNO': 30,
 'EMPNO': 7521,
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6a7c3d2aaebd5167825')}

In [26]:
# 급여가 2450보다 크거나 같은 데이터 값을 출력
# 작은 값을 출력하고 싶으면 $lt, 작거나 같은값이라면 $lte
result = db.emp.find(
    {
        "SAL" : {"$gte" : 2450}
    }
)

for list in result:
    print(list)

### SELECT * FROM emp WHERE SAL >= 2450

{'_id': ObjectId('6232c6a7c3d2aaebd5167826'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6a7c3d2aaebd5167828'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6a7c3d2aaebd5167829'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6a7c3d2aaebd516782a'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6a7c3d2aaebd516782b'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6a7c3d2aaebd516782f'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [27]:
# SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN
result = db.emp.find(
    {
        "$or" : [
            {"ENAME" : "SMITH"}, {"ENAME" : "ALLEN"}
        ]
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232b721c3d2aaebd5167815'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b721c3d2aaebd5167816'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232c6a7c3d2aaebd5167823'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6a7c3d2aaebd5167824'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}

In [28]:
# SELECT *FROM emp WHERE ENAME = SMITH AND JOB = CLERK
result = db.emp.find(
    {
        "ENAME" : "SMITH",
        "JOB" : "CLERK"
    }
)

for list in result:
    print(list)

{'_id': ObjectId('6232b721c3d2aaebd5167815'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c6a7c3d2aaebd5167823'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}

In [36]:
# SELECT * FROM emp WHERE SAL >=2000 AND SAL < 4000
import pandas as pd
result = db.emp.find(
    {
        "SAL" :{
            "$gte" : 2000,
            "$lt" : 4000
        }
    }, {"_id" : 0} ### _id 값이 보기싫어서 지워주기
)

pd.DataFrame(result)

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL  DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0      20
1   7698  BLAKE  MANAGER  7839  1981-05-01  2850.0      30
2   7782  CLARK  MANAGER  7839  1981-06-09  2450.0      10
3   7788  SCOTT  ANALYST  7566  1987-06-28  3000.0      20
4   7902   FORD  ANALYST  7566  1981-12-03  3000.0      20

In [55]:
#SELECT * FROM emp WHERE ENAME LIKE %S%
result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S$"      ### "$regex" : "^S"  을 쓰면 제일 앞이 S인 글자를 전부 찾아준다./ "$regex" : "S$" 를 쓰면 S로 끝나는 글자가 나온다.
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b721c3d2aaebd5167818,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20
1,6232b721c3d2aaebd516781f,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20
2,6232b721c3d2aaebd5167820,7900,JAMES,CLERK,7698,1981-12-03,950.00,30
3,6232c6a7c3d2aaebd5167826,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
4,6232c6a7c3d2aaebd516782d,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
5,6232c6a7c3d2aaebd516782e,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [ ]:
# SELECT ENAME, JOB, SAL, DEPTNO FROM emp
# WHERE SAL > 1250 AND 
# SAL <= 3000 and
# JOB = SALESMAN
# ORDER BY ENAME

In [64]:
result = db.emp.find(
    {
       "SAL" :{
            "$gt" : 1250,
            "$lte" : 3000
        },
        "JOB" : "SALESMAN"
    },
    {
        "ENAME" : 1, "JOB" : 1, "SAL" : 1, "DEPTNO" : 1, "_id" : 0
    }
).sort("ENAME", -1)

pd.DataFrame(result)

    ENAME       JOB     SAL  DEPTNO
0  TURNER  SALESMAN  1500.0      30
1   ALLEN  SALESMAN  1600.0      30